Documents/ИА_ЗакрытиеЗаказаНаПриобретение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИА_ЗакрытиеЗаказаНаПриобретение</Name>
			<BasedOn>
				<xr:Item>Document.ИА_ЗаказНаПриобретение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИА_СредстваНаФондах</xr:Item>
				<xr:Item>AccumulationRegister.ИА_СредстваВРезервеНаФондах</xr:Item>
				<xr:Item>InformationRegister.ИА_ИсторияСтатусовЗВС</xr:Item>
				<xr:Item>AccumulationRegister.ИА_ЗаказыНаПриобретение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРезерваНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРезерваБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятьРезерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВеб</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВернутьНаФонды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фонд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ИА_ЗаказыНаПриобретение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_ЗаказыНаПриобретение</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваВРезервеНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваВРезервеНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСУ_ОперацииПоФондам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ИА_ИсторияСтатусовЗВС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ИсторияСтатусовЗВС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СостояниеЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗВС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаявкаНаОбязательства</v8:Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КСУ_ЛентаСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_ЛентаСобытий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Детали</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КСУ_ОперацииПоФондам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>КСУ_ОперацииПоФондам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнедоходноеПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложеноИзДохода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвращеноВДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаливкаФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставлениеЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратВыданногоЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПолученногоЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеСДругогоФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеВДругойФонд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрямаяВыплатаИзФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаПоЗаказу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеЗаказа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_СостояниеЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_СостояниеЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденРуководителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненРуководителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассмотретьНаФП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_НетВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_ЧастичныеВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_ВсёВыплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренЧастично_Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_НетВыплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_ЧастичныеВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_ВсёВыплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдобренПолностью_Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносНаСледующееФП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИА_ЗакрытиеЗаказаНаПриобретение/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИА_ЗаказНаПриобретение") Тогда
		ЗаказОснование = ДанныеЗаполнения.Ссылка;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЕСТЬNULL(ИА_ЗаказыНаПриобретениеОстатки.СуммаОстаток, 0) КАК ОстатокЗаказа,
		               |	ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток, 0) КАК ОстатокРезерва,
		               |	ИА_СредстваВРезервеНаФондахОстатки.Подразделение КАК Подразделение,
		               |	ИА_СредстваВРезервеНаФондахОстатки.Фонд КАК Фонд
		               |ИЗ
		               |	Документ.ИА_ЗаказНаПриобретение КАК ИА_ЗаказНаПриобретение
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_ЗаказыНаПриобретение.Остатки(&НаДату, ) КАК ИА_ЗаказыНаПриобретениеОстатки
		               |		ПО ИА_ЗаказНаПриобретение.Ссылка = ИА_ЗаказыНаПриобретениеОстатки.ЗП
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(&НаДату, ) КАК ИА_СредстваВРезервеНаФондахОстатки
		               |		ПО ИА_ЗаказНаПриобретение.Ссылка = ИА_СредстваВРезервеНаФондахОстатки.ЗП
		               |ГДЕ
		               |	ИА_ЗаказНаПриобретение.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ЗаказОснование);
		Запрос.УстановитьПараметр("НаДату", ?(ЗначениеЗаполнено(ЭтотОбъект.Дата),ЭтотОбъект.Дата,ТекущаяДата()));
		Выборка = Запрос.Выполнить().Выбрать();
		ВернутьНаФонды.Очистить();
		
		Пока Выборка.Следующий() Цикл
			ЭтотОбъект.Сумма = Выборка.ОстатокЗаказа;
			Если выборка.ОстатокРезерва > 0 Тогда
				Новстр = ВернутьНаФонды.Добавить();
				Новстр.Подразделение = Выборка.Подразделение;
				Новстр.Фонд = Выборка.Фонд;
				Новстр.Сумма = Выборка.ОстатокРезерва;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_СредстваВРезервеНаФондах.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.ИА_СредстваВРезервеНаФондах КАК ИА_СредстваВРезервеНаФондах
	               |ГДЕ
	               |	ИА_СредстваВРезервеНаФондах.ЗП = &ЗП
	               |	И ИА_СредстваВРезервеНаФондах.Период > &Период";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ЗП", ЗаказОснование);
	Выборка = запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Сообщить("Невозможно закрыть заказ т.к. по нему есть операции позже даты закрытия : " + выборка.Регистратор);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Движения.ИА_СредстваВРезервеНаФондах.Записывать = Истина;
	Движения.ИА_СредстваВРезервеНаФондах.Очистить();
	
	Движения.ИА_СредстваНаФондах.Записывать = Истина;
	Движения.ИА_СредстваНаФондах.Очистить();
	
	Движения.ИА_ИсторияСтатусовЗВС.Записывать = Истина;
	Движения.ИА_ИсторияСтатусовЗВС.Очистить();
	
	Движения.ИА_ЗаказыНаПриобретение.Записывать = Истина;
	Движения.ИА_ЗаказыНаПриобретение.Очистить();
		
	ФППоОрганизациям = Константы.ИА_ФП_ВестиФППоОрганизациям.Получить();
	
	// Снятие резерва
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток КАК Остаток,
        |	ИА_СредстваВРезервеНаФондахОстатки.Подразделение КАК Подразделение,
        |	ИА_СредстваВРезервеНаФондахОстатки.Фонд КАК Фонд
        |ИЗ
        |	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки(&НаДату, ЗП = &ЗП) КАК ИА_СредстваВРезервеНаФондахОстатки";
    
    Запрос.УстановитьПараметр("ЗП", ЗаказОснование);
    Запрос.УстановитьПараметр("НаДату", Дата -1);
    
    Выборка = Запрос.Выполнить().Выбрать();
	ИтогоСнятоРезерва = 0;
	Если Выборка.Следующий() Тогда
		ИтогоСнятоРезерва = Выборка.Остаток;
	КонецЕсли;
	
	Если ИтогоСнятоРезерва <> ВернутьНаФонды.Итог("Сумма") ТОгда
		Сообщить("Остаток зарезервированных средств под заказ не совпадает с суммой возвратов на фонды!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ИтогоСнятоРезерва > 0 тогда
		НомерЗаказа = ИА_ФПСервер.УбратьНули(ЗаказОснование.Номер);
		
    	Движение = Движения.ИА_СредстваВРезервеНаФондах.ДобавитьРасход();
		Движение.Период = Дата;
		Если ФППоОрганизациям Тогда
			Движение.Организация = ЗаказОснование.Организация; 
		КонецЕсли;
		Движение.Подразделение = Выборка.Подразделение; 
		Движение.Фонд = Выборка.Фонд; 
		Движение.ЗП = ЗаказОснование;
		Движение.СуммаБезнал = ИтогоСнятоРезерва;			
	
	
		Для каждого стр из ВернутьНаФонды Цикл
			Движение = Движения.ИА_СредстваНаФондах.ДобавитьРасход();
			Движение.Период = Дата;
			Если ФППоОрганизациям Тогда
				Движение.Организация = ЗаказОснование.Организация; 
			КонецЕсли;
			Движение.Подразделение = Выборка.Подразделение; 
			Движение.Фонд = Выборка.Фонд; 
			Движение.СуммаБезнал =  стр.Сумма;
			Движение.Операция = Перечисления.КСУ_ОперацииПоФондам.ЗакрытиеЗаказа;
			Движение.ПояснениеТекст = "Заказ №"+ НомерЗаказа +" на фонд " + стр.Фонд;
			
			Движение = Движения.ИА_СредстваНаФондах.ДобавитьПриход();
			Движение.Период = Дата;
			Если ФППоОрганизациям Тогда
				Движение.Организация = ЗаказОснование.Организация; 
			КонецЕсли;
			Движение.Подразделение = стр.Подразделение; 
			Движение.Фонд = стр.Фонд; 
			Движение.СуммаБезнал = стр.Сумма;
			Движение.Операция = Перечисления.КСУ_ОперацииПоФондам.ЗакрытиеЗаказа;
			Движение.ПояснениеТекст = "Заказ №"+ НомерЗаказа +" с фонда " + Выборка.Фонд;
		КонецЦикла;
	КонецЕсли;

	// закрытие заказа
	Движение = Движения.ИА_ЗаказыНаПриобретение.ДобавитьРасход();
	Движение.Период = Дата;
	Движение.Организация = ЗаказОснование.Организация; 
	Движение.ЗП = ЗаказОснование;
	Движение.Сумма = Сумма;
	
	// статус
	Запрос.Текст = 
        "ВЫБРАТЬ
        |	Резервы.СуммаБезналПриход КАК Одобрено,
        |	Резервы.СуммаБезналРасход КАК Выплачено,
        |	Резервы.ЗП.Сумма КАК СуммаЗаказа
        |ИЗ
        |	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, &НаДату, , ЗП = &ЗП) КАК Резервы";
	Выборка = Запрос.Выполнить().Выбрать();
	
	НовыйСтатус = Перечисления.ИА_СостояниеЗаказа.Закрыт;
	
	текстСтатуса =  "Закрыт без выплат";
	Если Выборка.Следующий() и Выборка.Выплачено > 0 Тогда
		Если Выборка.Одобрено >= Выборка.СуммаЗаказа Тогда  // полностью одобрен
			НовыйСтатус = Перечисления.ИА_СостояниеЗаказа.ОдобренПолностью_Закрыт;
			текстСтатуса = "Закрыт (был одобрен полностью)";
		Иначе
			НовыйСтатус = Перечисления.ИА_СостояниеЗаказа.ОдобренЧастично_Закрыт;
			текстСтатуса = "Закрыт (был одобрен частично)";
		КонецЕсли;
	КонецЕсли;
	дв = Движения.ИА_ИсторияСтатусовЗВС.Добавить();
	дв.Период = Дата;
	дв.ЗВС = ЗаказОснование;
	дв.Статус = НовыйСтатус;
	
	ЗаписьЛенты = РегистрыСведений.КСУ_ЛентаСобытий.СоздатьМенеджерЗаписи();
	ЗаписьЛенты.ПериодСобытия = Дата;
	ЗаписьЛенты.ДатаСобытия = ТекущаяДата();
	ЗаписьЛенты.Объект = ЗаказОснование;
	ЗаписьЛенты.Событие = текстСтатуса;
	Если ВернутьНаФонды.Количество()>0 Тогда
		ЗаписьЛенты.Событие  = ЗаписьЛенты.Событие + ". Возвращено зарезервированных средств: "+ формат(ВернутьНаФонды.итог("Сумма"),"ЧДЦ=2; ЧН=");
	КонецЕсли;
	ЗаписьЛенты.Событие  = ЗаписьЛенты.Событие + ". Закрытие заказа №" + Номер;
	ЗаписьЛенты.Детали = НовыйСтатус;
	ЗаписьЛенты.Ответственный = Ответственный;
	
	ЗаписьЛенты.Записать();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Движение = РегистрыСведений.КСУ_ЛентаСобытий.СоздатьМенеджерЗаписи();
	Движение.ПериодСобытия = Дата;
	Движение.ДатаСобытия = ТекущаяДата();
	Движение.Объект = ЗаказОснование;		
	Движение.Событие = "Отмена проведения Закрытия заказа №"+Номер;
	Движение.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Движение.Записать();
КонецПроцедуры
